SkyRocketToys/STM8TX/lib/cypress.c
#define MAX_CHANNELS 16

static struct {
    uint8_t channels[23];
    uint8_t mfg_id[4];
    uint8_t current_channel;
    uint8_t current_rf_channel;
    uint16_t crc_seed;
    uint8_t sop_col;
    uint8_t data_col;
    uint8_t last_sop_code[8];
    uint8_t last_data_code[16];
    
    uint16_t num_channels;
    uint16_t pwm_channels[MAX_CHANNELS];
    uint32_t bind_send_end_ms;
    bool invert_seed;
    uint8_t zero_counter;
    bool receive_telem;
    uint32_t telem_recv_count;
    uint16_t sends_since_recv;
    uint16_t sends_since_power_change;
    uint32_t send_count;
    uint16_t rssi_sum;
    uint16_t rssi_count;
    uint8_t power_level;
    bool FCC_test_mode;
    bool FCC_scan_mode;
    uint8_t FCC_scan_count;
    uint8_t FCC_test_chan;
    uint8_t FCC_test_power;
    uint8_t factory_test_mode;
    int8_t last_CW_chan;
    bool fcc_CW_mode;
    uint16_t last_tx_count;
    uint16_t last_tr_count;
    uint8_t current_telem_rssi;
    uint8_t current_telem_pps;
    uint8_t current_send_pps;
    uint8_t tx_max_power;
    uint8_t autobind_count;
} dsm;

static void radio_init_hw(void);
static void cypress_transmit16(const uint8_t data[16]);
static void dsm_set_channel(uint8_t channel, bool is_dsm2, uint8_t sop_col, uint8_t data_col, uint16_t crc_seed);
static void send_normal_packet(void);
static void send_bind_packet(void);


static void cypress_reset(void)
{
    // hold reset high for 500ms
    gpio_set(RADIO_RST);
    delay_ms(500);
    gpio_clear(RADIO_RST);
    delay_ms(500);
}

void radio_init(void)
{
    uint8_t tx_max;
    
    printf("radio_init\n");

    // setup RST pin on PD0
    gpio_config(RADIO_RST, GPIO_OUTPUT_PUSHPULL);

    // setup TXEN
    gpio_config(RADIO_TXEN, GPIO_OUTPUT_PUSHPULL);
    gpio_set(RADIO_TXEN);

    // setup radio CE
    gpio_config(RADIO_CE, GPIO_OUTPUT_PUSHPULL);
    gpio_set(RADIO_CE);

    // setup interrupt
    gpio_config(RADIO_INT, GPIO_INPUT_FLOAT_IRQ);

    tx_max = eeprom_read(EEPROM_TXMAX);
    // don't use power levels below 4
    if (tx_max > 3 && tx_max < 9) {
        dsm.tx_max_power = tx_max-1;
    } else {
        dsm.tx_max_power = 3;
    }
    
    cypress_reset();

    radio_init_hw();
}

/*
  read one register value
 */
static uint8_t read_register(uint8_t reg)
{
    uint8_t d[2] = { reg, 0 };
    spi_transfer(2, d, d);
    return d[1];
}

/*
  write one register value
 */
static void write_register(uint8_t reg, uint8_t value)
{
    uint8_t d[2] = { reg | FLAG_WRITE, value };
    spi_write(2, d);
}

/*
  read radio status, handling the race condition between completion and error
 */
static uint8_t read_status_debounced(uint8_t adr)
{
    uint8_t ret;

    spi_force_chip_select(true);
    ret = read_register(adr);

    // If COMPLETE and ERROR bits mismatch, then re-read register
    if ((ret & (CYRF_RXC_IRQ | CYRF_RXE_IRQ)) != 0
        && (ret & (CYRF_RXC_IRQ | CYRF_RXE_IRQ)) != (CYRF_RXC_IRQ | CYRF_RXE_IRQ)) {
        uint8_t v2 = spi_read1();
        ret |= v2;   // re-read and make bits sticky
    }
    spi_force_chip_select(false);
    return ret;
}

/*
  force the initial state of the radio
 */
static void force_initial_state(void)
{
    while (true) {
        uint16_t n = 10000;
        write_register(CYRF_XACT_CFG, CYRF_FRC_END);
        do {
            if ((read_register(CYRF_XACT_CFG) & CYRF_FRC_END) == 0) {
                return;                     // FORCE_END done (osc running)
            }
        } while (n--);

        // FORCE_END failed to complete, implying going SLEEP to IDLE and
        // oscillator failed to start.  Recover by returning to SLEEP and
        //  trying to start oscillator again.
        write_register(CYRF_XACT_CFG, CYRF_MODE_SLEEP);
    }
}

/*
  set desired channel
 */
static void set_channel(uint8_t channel)
{
    //printf("chan %u\n", channel);
    write_register(CYRF_CHANNEL, channel);

    // wait worst case time for synthesiser to settle (listed as 270us in datasheet)
    delay_us(300);
}

static void radio_set_config(const struct reg_config *conf, uint8_t size)
{
    uint8_t i;
    // setup required radio config
    for (i=0; i<size; i++) {
        write_register(conf[i].reg, conf[i].value);
    }
}

#if SUPPORT_DSMX
/*
  Generate the DSMX channels from the manufacturer ID
 */
static void dsm_generate_channels_dsmx(uint8_t mfg_id[4], uint8_t channels[23])
{
    // Calculate the DSMX channels
    int idx = 0;
    uint32_t id = ~((((uint32_t)mfg_id[0]) << 24) | (((uint32_t)mfg_id[1]) << 16) |
                    (((uint32_t)mfg_id[2]) << 8) | (mfg_id[3] << 0));
    uint32_t id_tmp = id;
    uint8_t next_ch;

    // While not all channels are set
    while(idx < 23) {
        int i;
        int count_3_27 = 0, count_28_51 = 0, count_52_76 = 0;

        id_tmp = id_tmp * 0x0019660D + 0x3C6EF35F; // Randomization
        next_ch = ((id_tmp >> 8) % 0x49) + 3;       // Use least-significant byte and must be larger than 3
        if (((next_ch ^ id) & 0x01 ) == 0) {
            continue;
        }

        // Go trough all already set channels
        for (i = 0; i < idx; i++) {
            // Channel is already used
            if (channels[i] == next_ch) {
                break;
            }

            // Count the channel groups
            if(channels[i] <= 27) {
                count_3_27++;
            } else if (channels[i] <= 51) {
                count_28_51++;
            } else {
                count_52_76++;
            }
        }

        // When channel is already used continue
        if (i != idx) {
            continue;
        }

        // Set the channel when channel groups aren't full
        if ((next_ch < 28 && count_3_27 < 8)                        // Channels 3-27: max 8
            || (next_ch >= 28 && next_ch < 52 && count_28_51 < 7)    // Channels 28-52: max 7
            || (next_ch >= 52 && count_52_76 < 8)) {                // Channels 52-76: max 8
            channels[idx++] = next_ch;
        }
    }
}


/*
  setup for DSMX transfers
 */
static void dsm_setup_transfer_dsmx(void)
{
    dsm.current_channel = 0;

    dsm.crc_seed = ~((dsm.mfg_id[0] << 8) + dsm.mfg_id[1]);
    dsm.sop_col = (dsm.mfg_id[0] + dsm.mfg_id[1] + dsm.mfg_id[2] + 2) & 0x07;
    dsm.data_col = 7 - dsm.sop_col;

    dsm_generate_channels_dsmx(dsm.mfg_id, dsm.channels);
    printf("Setup for DSMX send\n");
}
#endif // SUPPORT_DSMX

