SkyRocketToys/STM8TX/lib/cypress.c
/*
  scan for best channels
 */
static void scan_channels(void)
{
    uint8_t i;
    uint8_t best = 0;
    uint8_t best_rssi = 32;
    static uint8_t rssi[DSM_MAX_CHANNEL/2];
    uint8_t wifi_chan = eeprom_read(EEPROM_WIFICHAN_OFFSET);
    uint8_t avoid_chan = ((wifi_chan-1) * 5) + 10;
    uint8_t avoid_chan_low=0, avoid_chan_high=0;

    printf("WiFi: %u\n", wifi_chan);
    
    if (wifi_chan != 0) {
        // avoid 22MHz band around WiFi channel
        if (avoid_chan < 11) {
            avoid_chan_low = 0;
        } else {
            avoid_chan_low = avoid_chan - 11;
        }
        avoid_chan_high = avoid_chan + 11;
    }
    
    write_register(CYRF_XACT_CFG, CYRF_MODE_RX | CYRF_FRC_END);
    write_register(CYRF_RX_ABORT, 0);
    delay_ms(1);

    // find the first channel
    i = 0;
    while (true) {
        uint16_t samples = 1500;
        uint8_t highest = 0;

        if (i < DSM_SCAN_MIN_CH || i > DSM_SCAN_MAX_CH) {
            // avoid low and high channels
            rssi[i/2] = 0xff;
            i += 2;
            if (i >= DSM_MAX_CHANNEL) {
                break;
            }
            continue;
        }

        if (i >= avoid_chan_low && i <= avoid_chan_high) {
            printf("%u:WF ", i);
            rssi[i/2] = 0xff;
            i += 2;
            if (i >= DSM_MAX_CHANNEL) {
                break;
            }
            continue;
        }
        
        set_channel(i);
        while (samples--) {
            uint8_t r = read_register(CYRF_RSSI) & 0x1F;
            if (r > highest) {
                highest = r;
            }
        }
        
        printf("%u:%u ", i, highest);
        rssi[i/2] = highest;
        if (highest < best_rssi) {
            best = i;
            best_rssi = highest;
        }

        i += 2;
        if (i > DSM_SCAN_MAX_CH) {
            break;
        }
    }
    
    printf("\n");

    dsm.channels[0] = best;

    best = 0;
    best_rssi = 32;
    
    // find the second channel
    for (i=0; i<=DSM_SCAN_MAX_CH; i+=2) {
        if (i != dsm.channels[0] && (i>dsm.channels[0]+10 || i<dsm.channels[0]-10)) {
            if (rssi[i/2] < best_rssi) {
                best_rssi = rssi[i/2];
                best = i;
            }
        }
    }
    dsm.channels[1] = best;

    printf("Chose channels %u and %u\n", dsm.channels[0], dsm.channels[1]);
}

/*
  setup for DSM2 transfers
 */
static void dsm_setup_transfer_dsm2(void)
{
    dsm.current_channel = 0;

    dsm.crc_seed = ~((dsm.mfg_id[0] << 8) + dsm.mfg_id[1]);
    dsm.sop_col = (dsm.mfg_id[0] + dsm.mfg_id[1] + dsm.mfg_id[2] + 2) & 0x07;
    dsm.data_col = 7 - dsm.sop_col;

    if (dsm.factory_test_mode == 0) {
        // scan for best channels
        scan_channels();
    } else {
        dsm.channels[0] = (dsm.factory_test_mode*7) % DSM_MAX_CHANNEL;
        dsm.channels[1] = (dsm.channels[0] + 5) % DSM_MAX_CHANNEL;
    }

    printf("Setup for DSM2 send\n");
}

/*
  setup for DSM transfers
 */
static void dsm_setup_transfer(void)
{
    if (is_DSM2() && !dsm.FCC_test_mode) {
        dsm_setup_transfer_dsm2();
#if SUPPORT_DSMX
    } else {
        dsm_setup_transfer_dsmx();
#endif
    }
}

/*
  initialise the radio
 */
static void radio_init_hw(void)
{
    printf("Cypress: radio_init_hw starting\n");

    // wait for radio to settle
    while (true) {
        uint8_t chan = read_register(CYRF_CHANNEL);
        printf("chan=%u\n", chan);
        if (chan == 23) {
            break;
        }
        write_register(CYRF_CHANNEL, 23);
        delay_ms(100);
    }

    // base config
    radio_set_config(cyrf_config, ARRAY_SIZE(cyrf_config));

    // start with receive config
    radio_set_config(cyrf_transfer_config, ARRAY_SIZE(cyrf_transfer_config));

#if DISABLE_CRC
    write_register(CYRF_RX_OVERRIDE, CYRF_DIS_RXCRC);
#endif
    
    write_register(CYRF_XTAL_CTRL,0x80);  // XOUT=BitSerial
    force_initial_state();
    write_register(CYRF_PWR_CTRL,0x20);   // Disable PMU

    // start in NONE state
    state = STATE_NONE;

    printf("Cypress: radio_init_hw done\n");
}

/*
  write multiple bytes
 */
void write_multiple(uint8_t reg, uint8_t n, const uint8_t *data)
{
    spi_force_chip_select(true);
    reg |= FLAG_WRITE;
    spi_write(1, &reg);
    spi_write(n, data);
    spi_force_chip_select(false);
}

/*
  start telemetry receive
 */
static void start_telem_receive(void)
{
    write_register(CYRF_RX_ABORT, 0);
    write_register(CYRF_XACT_CFG, CYRF_MODE_SYNTH_RX | CYRF_FRC_END);
    write_register(CYRF_RX_IRQ_STATUS, CYRF_RXOW_IRQ);
    write_register(CYRF_RX_CTRL, CYRF_RX_GO | CYRF_RXC_IRQEN | CYRF_RXE_IRQEN);
}

static uint8_t last_mode;

static void process_telem_packet(const struct telem_packet_cypress *pkt)
{
    switch (pkt->type) {
    case TELEM_STATUS:
        memcpy(&t_status, &pkt->payload.status, sizeof(t_status));
        dsm.sends_since_recv = 0;
        if (t_status.tx_max > 3 && t_status.tx_max < 9) {
            // adjust power level on the fly
            dsm.tx_max_power = t_status.tx_max-1;
        }
        if (t_status.flight_mode != last_mode) {
            uint8_t i;
            printf("mode: %u ", t_status.flight_mode);
            for (i=0; i<14; i++) {
                printf("%x ", pkt->payload.pkt[i]);
            }
            printf("\n");
            last_mode = t_status.flight_mode;
        }
        dsm.telem_recv_count++;
        break;
    case TELEM_FW:
    case TELEM_PLAY: {
        struct telem_firmware fw;
        memcpy(&fw, &pkt->payload.fw, sizeof(fw));
        printf("FW type=%u ofs=%u len=%u\n", pkt->type, fw.offset, fw.len);
        fw.offset = ((fw.offset & 0xFF)<<8) | (fw.offset>>8);
        if (pkt->type == TELEM_FW) {
            if (fw.offset < 16*1024 && fw.len <= 8) {
                eeprom_flash_copy(fw.offset, &fw.data[0], fw.len);
            }
        } else {
            buzzer_tune_add(fw.offset, &fw.data[0], fw.len);
        }
        telem_ack_value = fw.seq;
        break;
    }
    }
}

/*
  handle a receive IRQ
 */
static void irq_handler_recv(uint8_t rx_status)
{
    struct telem_packet_cypress pkt;
    uint8_t rlen;
    uint8_t crc;
    
