SkyRocketToys/STM8TX/lib/cypress.c
    if ((rx_status & (CYRF_RXC_IRQ | CYRF_RXE_IRQ)) == 0) {
        // nothing interesting yet
        return;
    }

    rlen = read_register(CYRF_RX_COUNT);
    if (rlen != 16) {
        printf("rlen=%u\n", rlen);
        spi_read_registers(CYRF_RX_BUFFER, (uint8_t *)&pkt, 16);
        return;
    }
    spi_read_registers(CYRF_RX_BUFFER, (uint8_t *)&pkt, rlen);
    crc = crc_crc8((uint8_t*)&pkt.type, 15);
    if (crc == pkt.crc) {
        dsm.rssi_sum += read_register(CYRF_RSSI) & 0x1F;
        dsm.rssi_count++;
        process_telem_packet(&pkt);
    }
}

/*
  handle a receive IRQ
 */
static void irq_handler_send(uint8_t tx_status)
{
    if (tx_status & CYRF_TXC_IRQ) {
        if (state == STATE_RECV_WAIT) {
            state = STATE_RECV_TELEM;
            start_telem_receive();
        }
    }
}


/*
  IRQ handler
 */
void radio_irq(void)
{
    // always read both rx and tx status. This ensure IRQ is cleared
    uint8_t rx_status = read_status_debounced(CYRF_RX_IRQ_STATUS);
    uint8_t tx_status = read_status_debounced(CYRF_TX_IRQ_STATUS);

    //printf("rx_status=0x%x tx_status=0x%x\n", rx_status, tx_status);
    
    switch (state) {
    case STATE_BIND_SEND:
    case STATE_AUTOBIND_SEND:
    case STATE_SEND:
    case STATE_RECV_WAIT:
        irq_handler_send(tx_status);
        break;

    case STATE_RECV_TELEM:
        irq_handler_recv(rx_status);
        break;
        
    default:
        break;
    }
}

/*
 Set the current DSM channel with SOP, CRC and data code
 */
static void dsm_set_channel(uint8_t channel, bool is_dsm2, uint8_t sop_col, uint8_t data_col, uint16_t crc_seed)
{
    uint8_t pn_row = is_dsm2? channel % 5 : (channel-2) % 5;

    //printf("c=%u s=0x%x\n", channel, crc_seed);
    
    // Change channel
    set_channel(channel);

    // set CRC seed
    write_register(CYRF_CRC_SEED_LSB, crc_seed & 0xff);
    write_register(CYRF_CRC_SEED_MSB, crc_seed >> 8);

    // set start of packet code
    if (memcmp(dsm.last_sop_code, pn_codes[pn_row][sop_col], 8) != 0) {
        write_multiple(CYRF_SOP_CODE, 8, pn_codes[pn_row][sop_col]);
        memcpy(dsm.last_sop_code, pn_codes[pn_row][sop_col], 8);
    }

    // set data code
    if (memcmp(dsm.last_data_code, pn_codes[pn_row][data_col], 16) != 0) {
        write_multiple(CYRF_DATA_CODE, 16, pn_codes[pn_row][data_col]);
        memcpy(dsm.last_data_code, pn_codes[pn_row][data_col], 16);
    }
}

/*
  send a DSM2 autobind packet

  The autobind packet is sent using normal transfer modulation but
  with SOP and data codes that are independent of the mfg code. This
  ensures it takes the same time to send as a normal packet, which is
  important to retain correct timing
 */
static void autobind_send(void)
{
    state = STATE_AUTOBIND_SEND;

    is_dsm2 = true;
    
    dsm_set_channel(AUTOBIND_CHANNEL, true, 0, 0, 0);

    // send auto-bind at low (and fixed) power. This allows for RSSI to be used by RX
    // to detect that TX is a long way from RX, to avoid accidential auto-bind
    write_register(CYRF_TX_CFG, CYRF_DATA_CODE_LENGTH | CYRF_DATA_MODE_8DR | CYRF_PA_M18);

    send_bind_packet();
}


#if SUPPORT_DSMX
// order of channels in DSMX packet
static const uint8_t chan_order[7] = { 1, 5, 2, 4, 6, 0, 3 };
#endif

/*
  send a normal packet
 */
static void send_normal_packet(void)
{
    uint8_t pkt[16];
    uint8_t i;
    uint8_t chan_count = is_DSM2()?2:23;
    uint16_t seed;
    bool send_zero = false;
    bool send_autobind = false;
    
    if (state == STATE_AUTOBIND_SEND) {
        // reset power level after autobind
        write_register(CYRF_TX_CFG, CYRF_DATA_CODE_LENGTH | CYRF_DATA_MODE_8DR | dsm.power_level);
    }

    if (state != STATE_SEND) {
        state = STATE_SEND;
    }
    
    /*
      when sending 7 channels with the DSMX_2 protocol we need to
      occasionally send a zero bit in the leading channel high bit in
      order to successfully connect with DSMX receivers
     */
    dsm.zero_counter++;
    if (dsm.zero_counter < 23 && (dsm.current_channel % 4 == 2)) {
        send_zero = true;
    }
    if (dsm.zero_counter > 70) {
        dsm.zero_counter = 0;
    }

    // we setup the new callback before we set the channel as setting
    // the channel takes 300us for the synthesiser to settle (worst
    // case)
    if (dsm.invert_seed) {
        // odd channels are sent every 3ms, even channels every 7ms, total frame time 10ms
        timer_call_after_ms(2, send_normal_packet);    
        dsm.receive_telem = false;
    } else {
        state = STATE_RECV_WAIT;
        timer_call_after_ms(6, send_normal_packet);
        dsm.receive_telem = true;
    }

    /*
      send AUTOBIND packets every 4 sends when we have never received
      a telemetry packet in DSM2 mode
     */
    if (dsm.receive_telem == false &&
        dsm.factory_test_mode == 0 &&
        is_dsm2 &&
        dsm.autobind_count > 4 && dsm.telem_recv_count == 0) {
        dsm.autobind_count = 0;
        send_autobind = true;
    } else {
        dsm.autobind_count++;
    }
        
    write_register(CYRF_XACT_CFG, CYRF_MODE_SYNTH_TX | CYRF_FRC_END);
    write_register(CYRF_RX_ABORT, 0);
    
    memset(pkt, 0, 16);

    if (is_DSM2()) {
        pkt[0] = ~dsm.mfg_id[2];
        pkt[1] = ~dsm.mfg_id[3];
#if SUPPORT_DSMX
    } else {
        pkt[0] = dsm.mfg_id[2];
        pkt[1] = dsm.mfg_id[3];
#endif
    }

    for (i=0; i<7; i++) {
        int16_t v;
        uint8_t chan = i;
#if SUPPORT_DSMX
        if (!is_DSM2()) {
            chan = chan_order[i];
        }
#endif
        if (chan == 6 && dsm.invert_seed) {
            // send extra data on every 2nd packet
            chan = 7;
        }
        v = (((uint16_t)chan)<<11) | channel_value(chan);
        if (i == 0 && !send_zero) {
            v |= 0x8000;
        }
        pkt[2*(i+1)+1] = v & 0xFF;
        pkt[2*(i+1)] = v >> 8;
    }
    
    dsm.invert_seed = !dsm.invert_seed;
    
    dsm.current_channel = (dsm.current_channel + 1);
    dsm.current_channel %= chan_count;

    dsm.current_rf_channel = dsm.channels[dsm.current_channel];
    
    seed = dsm.crc_seed;
    if (dsm.invert_seed) {
        seed = ~seed;
    }

    if (send_autobind) {
        autobind_send();
    } else {
        dsm_set_channel(dsm.current_rf_channel, is_DSM2(),
                        dsm.sop_col, dsm.data_col, seed);
    
        cypress_transmit16(pkt);
    }
}


