SkyRocketToys/STM8TX/lib/cypress.c
/*
  transmit an unmodulated signal for FCC testing
 */
static void cypress_transmit_unmodulated(void)
{
    write_register(CYRF_PREAMBLE,0x01);
    write_register(CYRF_PREAMBLE,0x00);
    write_register(CYRF_PREAMBLE,0x00);
    
    write_register(CYRF_TX_OVERRIDE, CYRF_FRC_PRE);
    write_register(CYRF_TX_CTRL, CYRF_TX_GO);    
}

/*
  send a FCC packet
 */
static void send_FCC_packet(void)
{
    uint8_t pkt[16];
    uint16_t seed;
    uint8_t i;

    if (state != STATE_SEND) {
        state = STATE_SEND;
    }
    
    timer_call_after_ms(4, send_FCC_packet);
    dsm.receive_telem = false;

    if (!dsm.fcc_CW_mode) {
        write_register(CYRF_XACT_CFG, CYRF_MODE_SYNTH_TX | CYRF_FRC_END);
        write_register(CYRF_RX_ABORT, 0);
    }
    
    memset(pkt, 0, 16);
    
    pkt[0] = ~dsm.mfg_id[2];
    pkt[1] = ~dsm.mfg_id[3];

    for (i=0; i<7; i++) {
        int16_t v;
        uint8_t chan = i;
        v = (((uint16_t)chan)<<11) | i*100;
        pkt[2*(i+1)+1] = v & 0xFF;
        pkt[2*(i+1)] = v >> 8;
    }
    
    /*
      allow switching between min channel, mid-channel and max channel
     */
    dsm.current_channel = 0;
    dsm.current_rf_channel = dsm.FCC_test_chan;

    if (dsm.FCC_scan_mode) {
        dsm.FCC_scan_count++;
        if (dsm.FCC_scan_count == 200) {
            dsm.FCC_scan_count = 0;
            dsm.FCC_test_chan += 2;
            if (dsm.FCC_test_chan >= DSM_SCAN_MAX_CH) {
                dsm.FCC_test_chan = DSM_SCAN_MIN_CH;
            }
        }
    }
    
    seed = dsm.crc_seed;

    if (dsm.power_level != dsm.FCC_test_power) {
        dsm.power_level = dsm.FCC_test_power;
        write_register(CYRF_TX_CFG, CYRF_DATA_CODE_LENGTH | CYRF_DATA_MODE_8DR | dsm.FCC_test_power);
    }
    
    if (dsm.fcc_CW_mode) {
        if (dsm.last_CW_chan != (int8_t)dsm.FCC_test_chan) {
            dsm_set_channel(dsm.current_rf_channel, true, dsm.sop_col, dsm.data_col, seed);

            cypress_transmit_unmodulated();
        }
        dsm.last_CW_chan = dsm.FCC_test_chan;
    } else {
        if (dsm.last_CW_chan != -1) {
            dsm.last_CW_chan = -1;
            // setup default preamble
            write_register(CYRF_PREAMBLE,0x02);
            write_register(CYRF_PREAMBLE,0x33);
            write_register(CYRF_PREAMBLE,0x33);
            radio_set_config(cyrf_transfer_config, ARRAY_SIZE(cyrf_transfer_config));
            write_register(CYRF_TX_CFG, CYRF_DATA_CODE_LENGTH | CYRF_DATA_MODE_8DR | dsm.FCC_test_power);
        }
        dsm_set_channel(dsm.current_rf_channel, true, dsm.sop_col, dsm.data_col, seed);
        cypress_transmit16(pkt);
    }
}


/*
   Read the MFG id from the chip
 */
static void get_mfg_id(uint8_t mfg_id[6])
{
    write_register(CYRF_MFG_ID, 0xFF);
    spi_read_registers(CYRF_MFG_ID, mfg_id, 6);
    write_register(CYRF_MFG_ID, 0x00);
#if 0
    // this is used to match my OrangeRX TX for testing
    mfg_id[0] = 0xa5;
    mfg_id[1] = 0xa7;
    mfg_id[2] = 0x55;
    mfg_id[3] = 0x0c;
#endif
}

/*
  start normal send pattern
 */
static void start_normal_send(void)
{
    state = STATE_SEND;
    radio_set_config(cyrf_transfer_config, ARRAY_SIZE(cyrf_transfer_config));
#if DISABLE_CRC
    write_register(CYRF_RX_OVERRIDE, CYRF_DIS_RXCRC);
#endif
    dsm_setup_transfer();
    timer_call_after_ms(10, send_normal_packet);
}

/*
  start FCC send pattern
 */
static void start_FCC_send(void)
{
    state = STATE_SEND;
    radio_set_config(cyrf_transfer_config, ARRAY_SIZE(cyrf_transfer_config));
#if DISABLE_CRC
    write_register(CYRF_RX_OVERRIDE, CYRF_DIS_RXCRC);
#endif
    dsm_setup_transfer();
    timer_call_after_ms(10, send_FCC_packet);
}

/*
  send a bind packet
 */
static void send_bind_packet(void)
{
    uint8_t pkt[16];
    uint16_t bind_sum = 384 - 0x10;
    uint8_t i;
    
    pkt[0] = pkt[4] = ~dsm.mfg_id[0];
    pkt[1] = pkt[5] = ~dsm.mfg_id[1];
    pkt[2] = pkt[6] = ~dsm.mfg_id[2];
    pkt[3] = pkt[7] = ~dsm.mfg_id[3];

    // Calculate the sum
    for (i = 0; i < 8; i++) {
        bind_sum += pkt[i];
    }
    
    pkt[8] = (bind_sum>>8);
    pkt[9] = (bind_sum&0xFF);
    pkt[10] = 0x01;
    pkt[11] = 7; // num_channels
    if (is_DSM2()) {
        pkt[12] = DSM_DSM2_2;
#if SUPPORT_DSMX
    } else {
        pkt[12] = DSM_DSMX_2;
#endif
    }
    pkt[13] = 0;

    for (i = 8; i < 14; i++) {
        bind_sum += pkt[i];
    }
    
    pkt[14] = (bind_sum>>8);
    pkt[15] = (bind_sum&0xFF);

    cypress_transmit16(pkt);

    if (state == STATE_AUTOBIND_SEND) {
        return;
    }

    if (timer_get_ms() > dsm.bind_send_end_ms) {
        // finished bind send, go to transmit mode
        printf("Switching to normal send\n");
        start_normal_send();
    } else {
        // send bind every 10ms
        timer_call_after_ms(10, send_bind_packet);
    }
}

/*
  setup radio for bind on send side
 */
void radio_start_bind_send(bool use_dsm2)
{
    uint8_t data_code[16];
    uint32_t rr;

    is_dsm2 = use_dsm2;
    
    printf("Cypress: start_bind_send DSM2=%u\n", is_dsm2);

    get_mfg_id(dsm.mfg_id);
    
    write_register(CYRF_XACT_CFG, CYRF_MODE_SYNTH_TX | CYRF_FRC_END);
    write_register(CYRF_RX_ABORT, 0);
    
    state = STATE_BIND_SEND;

    radio_set_config(cyrf_bind_config, ARRAY_SIZE(cyrf_bind_config));

    write_register(CYRF_CRC_SEED_LSB, 0);
    write_register(CYRF_CRC_SEED_MSB, 0);

    write_multiple(CYRF_SOP_CODE, 8, pn_codes[0][0]);

    memcpy(data_code, pn_codes[0][8], 8);
    memcpy(&data_code[8], pn_bind, 8);
    write_multiple(CYRF_DATA_CODE, 16, data_code);

    rr = adc_value(0) + adc_value(1) + adc_value(2) + adc_value(3);
    dsm.current_rf_channel = (rr % DSM_MAX_CHANNEL) | 1;

    dsm.bind_send_end_ms = timer_get_ms() + 5000;

    printf("mfg_id={0x%x, 0x%x, 0x%x, 0x%x} chan=%u\n",
           dsm.mfg_id[0], dsm.mfg_id[1], dsm.mfg_id[2], dsm.mfg_id[3],
           dsm.current_rf_channel);
    
    set_channel(dsm.current_rf_channel);
    
    send_bind_packet();
}


/*
  setup radio for FCC test
 */
void radio_start_FCC_test(void)
{
    dsm.FCC_test_chan = DSM_SCAN_MIN_CH;
    dsm.FCC_test_power = CYRF_PA_4;
    dsm.last_CW_chan = -1;
    dsm.FCC_test_mode = true;
    is_dsm2 = true;

    printf("Cypress: start_FCC test\n");

    get_mfg_id(dsm.mfg_id);
    
    write_register(CYRF_XACT_CFG, CYRF_MODE_SYNTH_TX | CYRF_FRC_END);
    write_register(CYRF_RX_ABORT, 0);
    
    start_FCC_send();
}


