SkyRocketToys/STM8TX/lib/cypress.c
/*
  setup radio for normal sending
 */
void radio_start_send(bool use_dsm2)
{
#if !SUPPORT_DSMX
    use_dsm2 = true;
#endif
    
    is_dsm2 = use_dsm2;

    printf("Cypress: start_send DSM2=%u\n", is_dsm2);

    if (dsm.factory_test_mode != 0) {
        dsm.mfg_id[0] = dsm.factory_test_mode;
    } else {
        get_mfg_id(dsm.mfg_id);
    }
    
    write_register(CYRF_XACT_CFG, CYRF_MODE_SYNTH_TX | CYRF_FRC_END);
    write_register(CYRF_RX_ABORT, 0);
    
    printf("send start: mfg_id={0x%x, 0x%x, 0x%x, 0x%x}\n",
           dsm.mfg_id[0], dsm.mfg_id[1], dsm.mfg_id[2], dsm.mfg_id[3]);

    start_normal_send();
}

/*
  setup for factory mode
 */
void radio_start_factory_test(uint8_t test_mode)
{
    dsm.factory_test_mode = test_mode;
    radio_start_send(true);
}

/*
  auto-adjust transmit power to minimise battery usage and increase
  likelyhook of connection on low battery
 */
static void check_power_level(void)
{
    uint8_t current_power_level = dsm.power_level;
#if DYNAMIC_POWER_ADJUSTMENT
    if (dsm.sends_since_recv > 512 && dsm.power_level < dsm.tx_max_power) {
        dsm.power_level++;
        dsm.sends_since_recv = 0;        
    }
    if (dsm.sends_since_recv > 512 && dsm.power_level == dsm.tx_max_power) {
        dsm.power_level -= 3;
        dsm.sends_since_recv = 0;        
    }
    if (dsm.sends_since_recv < 2 && dsm.sends_since_power_change > 256) {
        if (dsm.power_level > 0 && t_status.rssi > 26) {
            dsm.power_level--;
        }
        if (dsm.power_level < dsm.tx_max_power && t_status.rssi < 20) {
            dsm.power_level++;
        }
    }
#else
    // always full power
    dsm.power_level = CYRF_PA_4;
#endif

    if (dsm.tx_max_power <= 3) {
        // don't do dynamic power at low power levels
        dsm.power_level = dsm.tx_max_power;
    }
    
    if (dsm.FCC_test_mode) {
        // choose power for FCC testing
        dsm.power_level = dsm.FCC_test_power;
    }
    if (dsm.power_level != current_power_level && state != STATE_BIND_SEND && state != STATE_AUTOBIND_SEND) {
        dsm.sends_since_power_change = 0;
        write_register(CYRF_TX_CFG, CYRF_DATA_CODE_LENGTH | CYRF_DATA_MODE_8DR | dsm.power_level);
    }
}

/*
  transmit a 16 byte packet
  this is a blind send, not waiting for ack or completion
*/
static void cypress_transmit16(const uint8_t data[16])
{
    check_power_level();
    
    write_register(CYRF_TX_LENGTH, 16);
    write_register(CYRF_TX_CTRL, CYRF_TX_CLR);

    write_multiple(CYRF_TX_BUFFER, 16, data);
    write_register(CYRF_TX_IRQ_STATUS, 0);
    write_register(CYRF_TX_CTRL, CYRF_TX_GO | CYRF_TXC_IRQEN);
    dsm.send_count++;
    dsm.sends_since_recv++;
    dsm.sends_since_power_change++;
}

uint8_t get_tx_power(void)
{
    return dsm.power_level;
}

/*
  called once per main loop to get packets rates and average RSSI values
 */
void radio_set_pps_rssi(void)
{
    // get current send pps
    dsm.current_send_pps = dsm.send_count - dsm.last_tx_count;
    dsm.last_tx_count = dsm.send_count;

    // get telemetry pps
    dsm.current_telem_pps = dsm.telem_recv_count - dsm.last_tr_count;
    dsm.last_tr_count = dsm.telem_recv_count;

    // get rssi average
    if (dsm.rssi_count > 0) {
        dsm.current_telem_rssi = dsm.rssi_sum / dsm.rssi_count;
        dsm.rssi_sum = 0;
        dsm.rssi_count = 0;
    } else {
        dsm.current_telem_rssi = 0;
    }
    
}

/*
  get the average RSSI from telemetry packets
 */
uint8_t get_telem_rssi(void)
{
    return dsm.current_telem_rssi;
}

/*
  get the send rate in PPS
 */
uint8_t get_send_pps(void)
{
    return dsm.current_send_pps;
}

/*
  get the telemetry receive rate in pps
 */
uint8_t get_telem_pps(void)
{
    return dsm.current_telem_pps;
}

/*
  switch between 3 FCC test modes
 */
void radio_next_FCC_power(void)
{
    dsm.FCC_test_power = (dsm.FCC_test_power+1) % (CYRF_PA_4+1);
}

/*
  get FCC test chan
 */
int8_t get_FCC_chan(void)
{
    return dsm.FCC_test_mode?dsm.FCC_test_chan:-1;
}

/*
  get FCC test power
 */
uint8_t get_FCC_power(void)
{
    return dsm.FCC_test_power+1;
}

/*
  set CW mode for FCC testing
 */
void radio_set_CW_mode(bool cw)
{
    dsm.fcc_CW_mode = cw;
}

void radio_change_FCC_channel(int8_t change)
{
    switch (dsm.FCC_test_chan) {
    case DSM_SCAN_MIN_CH:
        dsm.FCC_test_chan = change==1?DSM_SCAN_MID_CH:DSM_SCAN_MAX_CH;
        break;
    case DSM_SCAN_MID_CH:
        dsm.FCC_test_chan = change==1?DSM_SCAN_MAX_CH:DSM_SCAN_MIN_CH;
        break;
    default:
    case DSM_SCAN_MAX_CH:
        dsm.FCC_test_chan = change==1?DSM_SCAN_MIN_CH:DSM_SCAN_MID_CH;
        break;
    }
}

void radio_FCC_toggle_scan(void)
{
    dsm.FCC_scan_mode = !dsm.FCC_scan_mode;
    if (!dsm.FCC_scan_mode) {
        dsm.FCC_test_chan = DSM_SCAN_MIN_CH;
    }
}
